import { LocaleConfig } from "./types";

const locale: LocaleConfig = {
  labels: {
    common: {
    },
    error: {
      '100010': '不明なエラーが発生しました',
      '100020': '不明なエラーが発生しました',
      '100030': '不明なエラーが発生しました',
      '110010': '不明なエラーが発生しました',
      '110020': 'データが見つかりませんでした',
      '110030': '不明なエラーが発生しました',
      '110040': '不明なエラーが発生しました',
      '110050': '不明なエラーが発生しました',
      '130000': 'データへのアクセスが許可されていません',
      '130010': 'ログインできませんでした',
      '130020': 'ログインできませんでした',
      '130030': '読み込み専用です',
      '150000': '入力内容をご確認ください',
      '150010': '入力してください',
      '150020': '使用できない文字が含まれています',
      '150030': '入力された文字が長すぎます',
      '150031': '入力された文字が短すぎます',
      '150040': '入力内容をご確認ください',
      '150050': '数値以外が入力されています',
      '150051': '入力範囲をご確認ください',
      '150052': '入力範囲をご確認ください',
      '150060': '正しいメールアドレスを入力してください',
      '150070': '参照ループが発生している',
      '150080': '正しい電話番号を入力してください',
      '150090': '正しい日時を入力してください',
      '150100': '正しい郵便番号を入力してください',
      '150110': '参照データが存在しない',
      '150120': '正しい都道府県を入力してください',
      '150130': '不正な値',
      '150140': 'フィールドIDが不正',
    },
    succeed: {

    },
    ui: {

    },
    view: {

    },
    route: {

    }
  },
  isPrimary: false,
  type: "Custom"
};

export default locale;
